       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.

       PROCEDURE DIVISION.
           DISPLAY "Hello, COBOL beginner!"
           DISPLAY "Welcome to lesson 1."
           DISPLAY "Welcome to lesson 100."
           STOP RUN.
